export const projectIcon = new Map([
  [
    'aip',
    <svg xmlns="http://www.w3.org/2000/svg" key={'aip'} className="shrink-0 w-8 h-8" viewBox="0 0 30 30">
      <path
        fill="#c7642a"
        data-name="aip"
        d="m272.723 14.708 1.559-4.861a.4.4 0 0 1 .773.122l-.019 5.1a.4.4 0 0 0 .717.233l2.985-4.141a.4.4 0 0 1 .7.355l-1.6 4.849a.4.4 0 0 0 .61.443l4.119-3.016a.4.4 0 0 1 .553.553l-3.02 4.124a.4.4 0 0 0 .443.61l4.849-1.6a.4.4 0 0 1 .355.7l-4.141 2.985a.4.4 0 0 0 .233.717l5.1-.019a.4.4 0 0 1 .122.773L282.21 24.2a.4.4 0 0 0 0 .754l4.861 1.559a.4.4 0 0 1-.122.773l-5.1-.019a.4.4 0 0 0-.233.717l4.141 2.985a.4.4 0 0 1-.355.7l-4.849-1.6a.4.4 0 0 0-.443.61l3.016 4.119a.4.4 0 0 1-.553.553l-4.119-3.016a.4.4 0 0 0-.61.443l1.6 4.849a.4.4 0 0 1-.7.355l-2.985-4.141a.4.4 0 0 0-.717.233l.019 5.1a.4.4 0 0 1-.773.122l-1.559-4.861a.4.4 0 0 0-.754 0L270.41 39.3a.4.4 0 0 1-.773-.122l.019-5.1a.4.4 0 0 0-.717-.233l-2.985 4.141a.4.4 0 0 1-.7-.355l1.6-4.849a.4.4 0 0 0-.61-.443l-4.119 3.016a.4.4 0 0 1-.553-.553l3.016-4.119a.4.4 0 0 0-.443-.61l-4.849 1.6a.4.4 0 0 1-.355-.7l4.141-2.985a.4.4 0 0 0-.233-.717l-5.1.019a.4.4 0 0 1-.122-.773l4.861-1.559a.4.4 0 0 0 0-.754l-4.861-1.559a.4.4 0 0 1 .122-.773l5.1.019a.4.4 0 0 0 .233-.717l-4.141-2.985a.4.4 0 0 1 .355-.7l4.849 1.6a.4.4 0 0 0 .443-.61l-3.016-4.119a.4.4 0 0 1 .553-.553l4.119 3.016a.4.4 0 0 0 .61-.443l-1.6-4.849a.4.4 0 0 1 .7-.355l2.985 4.141a.4.4 0 0 0 .717-.233l-.019-5.1a.4.4 0 0 1 .773-.122l1.559 4.861a.4.4 0 0 0 .754-.015z"
        transform="translate(-257.346 -9.572)"
      />
    </svg>,
  ],
  [
    'imc',
    <svg xmlns="http://www.w3.org/2000/svg" key={'imc'} className="shrink-0 w-8 h-8" viewBox="0 0 50 45">
      <path
        fill="#CECECE"
        data-name="imc"
        d="M545.354 25.807c0-2.974-3.219-5.645-8.333-7.483 3.624-1.059 5.833-2.466 5.833-4.009 0-2.269-4.773-4.241-11.8-5.251 1.183-.572 1.867-1.245 1.867-1.967 0-2.071-5.627-3.75-12.568-3.75S507.786 5.026 507.786 7.1c0 .722.684 1.4 1.867 1.967-7.027 1.01-11.8 2.982-11.8 5.251 0 1.543 2.209 2.95 5.833 4.009-5.114 1.839-8.333 4.509-8.333 7.483 0 3 3.272 5.688 8.459 7.528-3.7 1.063-5.959 2.484-5.959 4.045 0 2.269 4.773 4.241 11.8 5.251-1.183.572-1.867 1.245-1.867 1.967 0 2.071 5.627 3.75 12.568 3.75s12.568-1.679 12.568-3.75c0-.722-.684-1.4-1.867-1.967 7.027-1.01 11.8-2.982 11.8-5.251 0-1.561-2.26-2.982-5.959-4.045 5.186-1.843 8.458-4.538 8.458-7.531z"
        transform="translate(-495.354 -3.347)"
      />
    </svg>,
  ],
  [
    'ltc',
    <svg xmlns="http://www.w3.org/2000/svg" key={'ltc'} className="shrink-0 w-8 h-8" viewBox="0 0 47.812 45">
      <path
        fill="#CECECE"
        data-name="ltc"
        d="M1374.506 41.633c-3.532 0-6.771 1.93-9.3 5.143-2.526-3.213-5.765-5.143-9.3-5.143-8.069 0-14.609 10.074-14.609 22.5s6.541 22.5 14.609 22.5c3.532 0 6.771-1.93 9.3-5.143 2.526 3.213 5.765 5.143 9.3 5.143 8.069 0 14.609-10.074 14.609-22.5s-6.54-22.5-14.609-22.5z"
        transform="translate(-1341.303 -41.633)"
      />
    </svg>,
  ],
  [
    'pc',
    <svg xmlns="http://www.w3.org/2000/svg" key={'pc'} className="shrink-0 w-8 h-8" viewBox="0 0 50.625 45">
      <path
        fill="#3f36b7"
        data-name="pc"
        d="M1634.417 1192.3c-4.912-4.366-12.785-5.081-20.791-2.6-8.006-2.48-15.878-1.766-20.791 2.6s-5.716 11.364-2.926 18.481c-2.791 7.116-1.986 14.114 2.926 18.481s12.785 5.081 20.791 2.6c8.006 2.481 15.878 1.766 20.791-2.6s5.716-11.364 2.926-18.481c2.79-7.116 1.986-14.114-2.926-18.481z"
        transform="translate(-1588.313 -1188.281)"
      />
    </svg>,
  ],
  [
    'dt',
    <svg xmlns="http://www.w3.org/2000/svg" key={'dt'} className="shrink-0 w-8 h-8" viewBox="0 0 50 50">
      <path
        fill="#CECECE"
        id="Path_56"
        data-name="dt"
        d="M754.415,1113.507a7.919,7.919,0,0,0-6.045-14.594,7.919,7.919,0,0,0-14.593-6.045,7.919,7.919,0,0,0-14.593,6.045,7.919,7.919,0,0,0-6.045,14.594,7.919,7.919,0,0,0,6.045,14.593,7.919,7.919,0,0,0,14.593,6.045,7.919,7.919,0,0,0,14.593-6.045,7.919,7.919,0,0,0,6.045-14.593Z"
        transform="translate(-708.777 -1088.507)"
      />
    </svg>,
  ],
  [
    'gm',
    <svg xmlns="http://www.w3.org/2000/svg" key={'gm'} className="shrink-0 w-8 h-8" viewBox="0 0 50 36.853">
      <path
        fill="#CECECE"
        data-name="gm"
        d="M886.369 50.479h-39.436a5.281 5.281 0 0 1-1.67-10.291l8.564-2.855h-6.894a5.281 5.281 0 0 1-1.67-10.291l8.564-2.855h-6.894a5.281 5.281 0 1 1 0-10.562h39.437a5.281 5.281 0 0 1 1.67 10.291l-8.564 2.855h6.894a5.281 5.281 0 0 1 1.67 10.291l-8.564 2.855h6.894a5.281 5.281 0 1 1 0 10.562z"
        transform="translate(-841.651 -13.626)"
      />
    </svg>,
  ],
  [
    'lsd',
    <svg xmlns="http://www.w3.org/2000/svg" key={'lsd'} className="shrink-0 w-8 h-8" viewBox="0 0 50 44.978">
      <path
        fill="#daa13d"
        data-name="lsd"
        d="M198.582 615.166h-6.636a.744.744 0 0 1-.644-1.116l3.318-5.747a6.25 6.25 0 0 0-2.288-8.538 6.25 6.25 0 0 0-8.538 2.288l-3.318 5.747a.744.744 0 0 1-1.289 0l-3.318-5.747a6.25 6.25 0 0 0-8.538-2.288 6.25 6.25 0 0 0-2.288 8.538l3.318 5.747a.744.744 0 0 1-.644 1.116h-6.636a6.25 6.25 0 0 0-6.25 6.25 6.25 6.25 0 0 0 6.25 6.25h6.636a.744.744 0 0 1 .644 1.116l-3.318 5.747a6.25 6.25 0 0 0 2.288 8.538 6.25 6.25 0 0 0 8.538-2.288l3.318-5.747a.744.744 0 0 1 1.289 0l3.318 5.747a6.25 6.25 0 0 0 8.538 2.288 6.25 6.25 0 0 0 2.288-8.538l-3.318-5.747a.744.744 0 0 1 .644-1.116h6.636a6.25 6.25 0 0 0 6.25-6.25 6.25 6.25 0 0 0-6.25-6.25z"
        transform="translate(-154.832 -598.927)"
      />
    </svg>,
  ],
])

export const projectList = [
  {
    id: 0,
    title: 'Aging in Place',
    description: 'การสูงวัยในถิ่นที่อยู่อาศัยเดิม อย่างมีสุขภาวะ',
    url: '/project/aip',
    icon: 'aip',
    enabled: true,
  },
  {
    id: 1,
    title: 'Intermediate Care',
    description: 'ระบบการดูแลผู้ป่วยระยะกลาง สำหรับผู้สูงอายุที่อยู่ในช่วง 6 เดือนทอง หลังพ้นภาวะวิกฤต',
    url: '/project/imc',
    icon: 'imc',
    enabled: false,
  },
  {
    id: 2,
    title: 'Long-Term Care',
    description: 'ระบบการดูแลระยะยาว สำหรับผู้สูงอายุที่มีภาวะพึ่งพิง',
    url: '/project/ltc',
    icon: 'ltc',
    enabled: false,
  },
  {
    id: 3,
    title: 'Palliative Care',
    description: 'ระบบการดูแลแบบประคับประคอง ในช่วงท้ายของชีวิต',
    url: '/project/pc',
    icon: 'pc',
    enabled: true,
  },
  {
    id: 4,
    title: 'Dementia',
    description: 'ระบบบริการแลการดูแลผู้มีภาวะสมองเสื่อม',
    url: '/project/dt',
    icon: 'dt',
    enabled: false,
  },
  {
    id: 5,
    title: 'Governing Mechanism',
    description: 'กลไกการติดตามขับเคลื่อนนโยบายเรื่องผู้สูงอายุ',
    url: '/project/gm',
    icon: 'gm',
    enabled: false,
  },
  {
    id: 6,
    title: 'Local Service Delivery Network',
    description: 'โครงสร้างเครือข่ายบริการสุขภาพระดับจังหวัด',
    url: '/project/lsd',
    icon: 'lsd',
    enabled: true,
  },
]

export const projectDropdown = [
  {
    id: 0,
    title: 'Aging in Place',
    description: 'การสูงวัยในถิ่นที่อยู่อาศัยเดิม อย่างมีสุขภาวะ',
    url: '/project/aip',
    icon: 'aip',
    enabled: true,
  },
  {
    id: 2,
    title: 'Local Service Delivery Network',
    description: 'การจัดการโครงสร้างเครือข่าย ระบบบริการสุขภาพระดับจังหวัด',
    url: '/project/lsd',
    icon: 'lsd',
    enabled: true,
  },
  {
    id: 3,
    title: 'Palliative Care',
    description: 'ระบบการดูแลแบบประคับประคอง ในช่วงท้ายของชีวิต',
    url: '/project/pc',
    icon: 'pc',
    enabled: true,
  },
  {
    id: 1,
    title: 'Intermediate Care',
    description: 'ระบบการดูแลผู้ป่วยระยะกลาง สำหรับผู้สูงอายุที่อยู่ในช่วง 6 เดือนทอง หลังพ้นภาวะวิกฤต',
    url: '/project/imc',
    icon: 'imc',
    enabled: false,
  },
  {
    id: 2,
    title: 'Long-Term Care',
    description: 'ระบบการดูแลระยะยาว สำหรับผู้สูงอายุที่มีภาวะพึ่งพิง',
    url: '/project/ltc',
    icon: 'ltc',
    enabled: false,
  },
  {
    id: 5,
    title: 'Governing Mechanism',
    description: 'กลไกการติดตามขับเคลื่อนนโยบายเรื่องผู้สูงอายุ',
    url: '/project/gm',
    icon: 'gm',
    enabled: false,
  },
  {
    id: 4,
    title: 'Dementia',
    description: 'ระบบบริการแลการดูแลผู้มีภาวะสมองเสื่อม',
    url: '/project/dt',
    icon: 'dt',
    enabled: false,
  },
]
